<?php
	/********************************************************************************************************
		userModify.php 接收用户填写修改的用户信息，然后根据用户账号，修改数据库里相应的资料信息

	程序 猿 ：黄建东  English Name:Wongsir
	编写日期：30/07/2015
	
	修改人员：
	修改日期：

	**********************************************************************************************************/
	//申明 userOperation 类对象
	$user=new userOperation();
	
	//获取前台传入的商品 id
	$id = isset($_GET['id'])? $_GET['id']:null;
	
	//修改订单状态数量
	//将待付款状态订单数量减一
	$_SESSION['paying'] -= 1;
	//将已取消订单状态数量加一
	$_SESSION['cancled'] +=1;

	//向前台输出待付款状态订单数量
	echo $_SESSION['paying'];
	
	//调用用户类成员函数 userCancleOrder 来更新数据库订单信息
	$user->userCancleOrder($id);



